test/zoo/ternary_unicity/ddl/ternary_unicity_0_ddl.dbml
Table "Disponibilité" {
  semaine VARCHAR(42) [not null]
  voilier VARCHAR(42) [not null]
  Indexes {
    (semaine, voilier) [pk]
  }
}

Table "Réservation" {
  "id résa" VARCHAR(42) [pk, not null]
  "num résa" VARCHAR(42)
  arrhes VARCHAR(42)
  "date réservation" VARCHAR(42)
  semaine VARCHAR(42) [not null]
  voilier VARCHAR(42) [not null]
  Indexes {
    "num résa" [unique]
    (semaine, voilier) [unique]
  }
}

Table Semaine {
  semaine VARCHAR(42) [pk, not null]
  "date début" VARCHAR(42)
  Indexes {
    "date début" [unique]
  }
}

Ref:"Disponibilité".semaine > Semaine.semaine
Ref:"Réservation".(semaine, voilier) > "Disponibilité".(semaine, voilier)
